"CIAdditionCompositing" = "加入顏色組件來達到改善亮度的效果。此濾鏡常用來加強亮度和做出鏡頭光斑效果。";"CIAffineClamp" = "在來源影像執行仿射的轉變，然後限制轉變後的影像邊緣的像素，向外延伸它們。除了產生的是無限範圍的影像外，此濾鏡的功能類似與 CIAffineTransform 濾鏡。若您需要模糊影像，但又想避免邊緣出現柔和黑色界線時，您可以使用此濾鏡。";"CIAffineTile" = "套用仿射轉變到影像上，然後將轉變後的影像並排顯示。";"CIAffineTransform" = "套用仿射轉變到影像上。您可以縮放、轉換或旋轉輸入影像。您還可以套用這些作業的組合。";"CIBarsSwipeTransition" = "從一個影像到另外一個的過場效果，藉由推擠前個影像的矩形部分來顯示目標影像。";"CIBlendWithMask" = "使用來自灰階遮罩的數值來在影像和背景之間補點。當遮罩的數值是 0.0，結果為背景。當數值是 1.0，結果為影像。";"CIBloom" = "柔化邊緣和套用適當的光亮程度到影像上。";"CIBoxBlur" = "使用方塊狀的迴旋核心來平滑或清晰影像。";"CIBumpDistortion" = "製作影像某個特定點的凹面或凸面效果。";"CIBumpDistortionLinear" = "製作從影像線性部分開始的凹凸。";"CICMYKHalftone" = "在白色頁面上，使用靛藍、洋紅、黃色和黑色水墨來製作來源影像的半色調演色性。";"CICheckerboardGenerator" = "會產生棋盤圖像。您可以指定棋盤的大小和顏色，以及圖案的清晰度。";"CICircleSplashDistortion" = "像素的變形開始於圓圈的週邊，且向外擴散。";"CICircularScreen" = "模擬圓形的半色調螢幕。";"CICircularWrap" = "用透明的圓形覆蓋影像。影像的變形，會隨與圓形中心的距離而增強。";"CIColorControls" = "調整飽和度、亮度和對比度數值。";"CIColorCube" = "使用三種尺寸的色盤來變化來源影像像素。色盤必須由使用預增 alpha 的浮點 RGBA 格組成。格是以標準順序組合起來的。資料的欄和列分別是紅色和綠色。每個資料平面後會有個較高的資料平面，它是藍色的。";"CIColorInvert" = "在影像插入顏色。";"CIColorMap" = "使用表格提供的對應數值，來執行來源顏色數值的非線性變化。";"CIColorMatrix" = "增加來源顏色數值，以及加入色偏率到每個顏色組件。";"CIColorMonochrome" = "重新對應顏色以讓它們回落到單個顏色色度內。";"CIColorPosterize" = "重新對應紅色、綠色和藍色組件為您為每個顏色組件指定的亮度值數字。此濾鏡會平面化顏色，以達到看起來就像絲印海報的效果。";"CIComicEffect" = "透過勾勒邊緣和套用半色調效果，模擬漫畫書畫法。";"CIConstantColorGenerator" = "產生實色。通常您會使用此濾鏡的輸出結果，來作為其他濾鏡的輸入。";"CICopyMachineTransition" = "使用模擬複印機效果來作為影像之間的過場效果。";"CICrop" = "套用裁切到影像。裁切後影像的大小和形狀，是由您指定的矩形決定的。";"CICrystallize" = "透過聚合來源像素顏色數值來製作多邊形的顏色塊。";"CIDiscBlur" = "使用光碟形狀的迴旋核心來平滑或清晰影像。";"CIDisintegrateWithMaskTransition" = "使用遮罩定義的形狀來作為影像之間的過場效果。";"CIDisplacementDistortion" = "將第二個影像的灰階數值套用到第一個影像。輸出的影像會有由灰階數值定義的紋理。";"CIDissolveTransition" = "在影像之間使用融合過場效果。";"CIDotScreen" = "模擬半色調螢幕的點圖案。";"CIEdges" = "找出影像的所有邊緣，並用顏色顯示出來。";"CIEdgeWork" = "製作影像的黑白演色性，看起來像木板的圖紋。";"CIEightfoldReflectedTile" = "透過套用 8 方反射對稱來從來源影像製作並排化影像。";"CIExposureAdjust" = "調整影像的曝光設定，類似您在更改相機的 F-停止時的控制曝光的方式。";"CIFalseColor" = "讓光度與雙色顏色選項對應。會經常使用人造的顏色來處理天文學和其他科學資料，例如紫外線和 X 光影像。";"CIFastBoxBlur" = "使用方塊狀的迴旋核心來平滑或清晰影像。";"CIFastDiscBlur" = "使用光碟形狀的迴旋核心來平滑或清晰影像。";"CIFlashTransition" = "製作閃光來作為影像的過場效果。您可以指定閃光的起點。開始是小小的，然後迅速擴展為用閃光的顏色覆蓋整個影像影格。當顏色漸退，目標影像便開始出現。";"CIFourfoldReflectedTile" = "透過套用 4 方反射對稱來從來源影像製作並排化影像。";"CIFourfoldRotatedTile" = "透過以 90 度旋轉來源檔案來從它製作並排化影像。";"CIFourfoldTranslatedTile" = "透過套用 4 個轉化作業來從來源影像製作並排化影像。";"CIGammaAdjust" = "調整中色度的亮度。此濾鏡通常是用來補償顯示器的非線性效果。調整 gamma 可有效更改黑白之間過場效果的斜率。";"CIGaussianBlur" = "用由高斯（Gaussian）分佈指定的量來延伸來源像素。";"CIGaussianGradient" = "使用高斯（Gaussian）分佈產生不同顏色變化的半徑。";"CIGlassDistortion" = "透過套用類似玻璃的質地來變形影像。輸出影像提高的部分便是套用質地對應的結果。";"CIGlassLozenge" = "製作菱形鏡片，並令鏡片所放置的影像的部分變形。";"CIGlideReflectedTile" = "透過轉化和模糊影像來從來源影像製作並排化影像。";"CIGloom" = "令影像的高亮部分變暗。";"CIHatchedScreen" = "模擬半色調螢幕的劃影線圖案。";"CIHeightFieldFromMask" = "從灰階遮罩製作連續的三維空間閣樓形狀的高度欄位。遮罩的白色數值定義高度欄位內的像素，而黑色數值則定義欄位外的像素。欄位的數值在這罩內是平滑且連續地變化，直到達到遮罩邊緣的數值 0。您可以搭配 CIShadedMaterial 濾鏡來使用此濾鏡，來製作形狀極度逼真的物體。";"CIHexagonalPixellate" = "顯示影像為有顏色的六角形（其顏色是它們取代的像素的平均值）。";"CIHoleDistortion" = "製作圓形區域，此區域會將影像像素向外推，且令那些像素儘量靠近圓形。";"CIHueAdjust" = "更改來源像素的整體彩度或色調。";"CIKaleidoscope" = "透過套用 12 方反射對稱來從來源影像製作萬花筒似的影像。";"CILanczosScaleTransform" = "產生來源影像高品質的縮放後版本。您通常會使用此濾鏡來縮小影像。";"CILenticularHaloGenerator" = "模擬鏡片散佈的衍射而產生的光暈。此濾鏡通常用來套用到其他影像來模擬鏡頭光斑和類似的效果。";"CILineOverlay" = "用黑色勾勒出影像的輪廓，而讓影像的沒有被勾勒的部分保持透明。結果會有 alpha，且用黑色進行算圖，您使用來源進行算圖成為另外一個影像，合成物和來源看起來不會相像。";"CILineScreen" = "模擬半色調螢幕的線條圖案。";"CILinearGradient" = "產生隨兩定義終點之間的線性軸變化的傾斜度。";"CIMaskToAlpha" = "將灰階影像轉換為被 alpha 遮罩的白色影像。來源影像的白色數值會產遮罩的內部，而黑色數值則會變得完全透明。";"CIMaximumCompositing" = "透過兩個輸入影像的顏色組件計算最大數值，並使用最大數值來製作輸出影像。這類似於減淡。";"CIMedianFilter" = "計算一組相鄰像素的中位數值，然後用此數值來取代每個像素的數值。效果是減少雜訊。";"CIMinimumCompositing" = "透過兩個輸入影像的顏色組件計算最小數值，並使用最小數值來製作輸出影像。這類似於加深。";"CIModTransition" = "影像之間的過場效果，透過不規則形狀的支持物逐漸顯露目標影像。";"CIMotionBlur" = "模糊影像來模擬效果，這個效果是使用攝影機在從特定角度和距離擷取影像所產生的。";"CIMultiplyCompositing" = "增強兩個輸入影像的顏色組件，並使用增強後的數值來製作輸出影像。此濾鏡通常用來加入聚光燈，或者類似光線效果到影像。";"CINoiseReduction" = "使用定義甚麼是雜訊的臨界值數值來減少雜訊。該數值下方的光度的小更動會被認為是雜訊，並會被當作雜訊而減少（本機模糊）。而臨界值數值上方的數值則會被認為是邊緣，因此它們會變得更清晰。";"CIOpTile" = "將套用了任何指定縮放或旋轉影像分割，然後再將它們組合起來，做出抽象美術的效果。";"CIPageCurlTransition" = "影像之間的過場效果，它是模擬捲曲頁面來在捲曲時候顯示新的影像。";"CIParallelogramTile" = "將影像用平行四邊形進行變形，然後再並排化結果。";"CIPerspectiveTile" = "套用透視改變到影像，然後將結果做成並排拼圖狀。";"CIPerspectiveTransform" = "改變影像的幾何位置來模擬從不同的角度觀察。您可以使用透視濾鏡令影像歪曲。";"CIPinchDistortion" = "製作矩形區域，此區域會向內擠壓影像像素，且令那些像素儘量靠近矩形。";"CIPixellate" = "令影像濃淡不均勻。";"CIPointillize" = "用點彩派風格算圖來源影像。";"CIRadialGradient" = "產生會隨兩個同心圓快速變化的傾斜。它只有在其中一個圓的半徑為 0 的時候才有效。";"CIRandomGenerator" = "產生無窮範圍的影像，範圍是由四個獨立的、不統一分佈的隨機數字（範圍是 0 到 1）。";"CIRippleTransition" = "影像之間的過場效果，製作從影像中心散開的圓形波紋，而新的影像則出現在波紋之中。";"CISepiaTone" = "將影像的顏色對應到不同的棕色。";"CIShadedMaterial" = "從高度範圍製作色彩較暗的影像。高度範圍是用來定義讓顏色較亮的形狀位於較高，而讓顏色較暗的形狀位於較低。您可以將此濾鏡與 CIHeightFieldFromMask 濾鏡組合使用，來快速製作遮罩的陰影，例如文字。";"CISharpenLuminance" = "透過讓影像更清晰來增加影像細節。它作用在影像的光度；而不會影像像素的色度。";"CISixfoldReflectedTile" = "透過套用 6 方反射對稱來從來源影像製作並排化影像。";"CISixfoldRotatedTile" = "透過以 60 度旋轉來源檔案來從它製作並排化影像。";"CISourceAtopCompositing" = "將來源影像放到背景影像上，然後使用背景影像的光度來決定要顯示的內容。合成物顯示背景影像，以及可透過背景影像看到的來源影像的部分。";"CISourceInCompositing" = "使用第二個影像來定義保留來源影像的內容，以有效裁切影像。";"CISourceOutCompositing" = "使用第二個影像來定義要從第一個影像取出的內容。";"CISourceOverCompositing" = "將第二個影像放在第一個的上面。";"CISpotColor" = "用點的顏色來取代一個或多個顏色範圍。";"CISpotLight" = "套用有方向的聚光燈效果到影像。";"CIStarShineGenerator" = "製作星爆圖案。輸出的影像通常會用作其他濾鏡的輸入";"CIStripesGenerator" = "產生條紋圖案。您可以控制條紋的顏色、間距和對比度。";"CISunbeamsGenerator" = "產生太陽效果。通常您會使用此日射濾鏡的輸出結果，來作為混合濾鏡的輸入。";"CISwipeTransition" = "使用模擬擦過動作來作為影像之間的過場效果。";"CITorusLensDistortion" = "製作圓形隆起鏡片，並令鏡片所放置的影像的部分變形。";"CITriangleTile" = "將影像的三角形部分對應到三角形區域，然後並排化結果。";"CITwelvefoldReflectedTile" = "透過套用 12 方反射對稱來從來源影像製作並排化影像。";"CITwirlDistortion" = "圍繞某點旋轉像素來做出旋轉效果。您可以指定旋轉的數字，以及效果的中心、半徑。";"CIUnsharpMask" = "增加影像中不同顏色像素之間邊緣的對比。";"CIVortexDistortion" = "圍繞某點旋轉像素來模擬旋渦。您可以指定旋轉的數字，以及效果的中心、半徑。";"CIWhitePointAdjust" = "調整影像的參考白色點，並且使用新的參考來對應來源中的所有顏色。";"CIZoomBlur" = "模擬當擷取影像時的縮放效果。";"CIColorBlendMode" = "搭配來源影像的彩度和飽和度數值，來使用背景的光度數值。此模式會保留影像的灰色水平。";"CIColorBurnBlendMode" = "讓背景影像樣板變暗來映出來源影像樣板。若來源影像樣板數值指定為白色，則不會產生變化。";"CIColorDodgeBlendMode" = "讓背景影像樣板變亮來映出來源影像樣板。若來源影像樣板數值指定為黑色，則不會產生變化。";"CIDarkenBlendMode" = "透過選擇較暗的樣板（從來源影像或背景）來製作複合影像樣板。結果會是，背景影像樣板會被任何較暗的來源影像樣板取代。在其他方面，背景影像樣板會保持不變。";"CIDifferenceBlendMode" = "視來源影像樣板或背景影像樣板的亮度數值較大，會抽取較大數值的樣版的顏色，或抽取較小數值的顏色。來源影像樣板數值若是黑色，則不會產生變化，若是白色，會插入背景顏色數值。";"CIExclusionBlendMode" = "製作效果，此效果類似用 CIDifferenceBlendMode 濾鏡製作，但是對比度稍低。黑色來源影像樣板數值不會製作更動，若是白色，則會插入背景顏色數值。";"CIHardLightBlendMode" = "依照來源影像樣板顏色，複製或掩蓋顏色。若來源影像樣板顏色亮過 50% 灰色，則會提亮背景，類似於掩蓋。若來源影像樣板顏色暗過 50% 灰色，則會令背景變暗，類似於複製。若來源影像樣板顏色剛好相當於 50% 灰色，則不會更動來源影像。而相當於純黑或白的影像樣板，導致的結果就是純黑或白。整體效果類似於您透過提亮照在來源影像刺目的聚光燈所達到的效果。";"CIHueBlendMode" = "搭配來源影像的彩度使用背景的光度和飽和度數值。";"CILightenBlendMode" = "透過選擇較亮的樣板（從來源影像或背景）來製作複合影像樣板。結果會是，背景影像樣板會被任何較亮的來源影像樣板取代。在其他方面，背景影像樣板會保持不變。";"CILuminosityBlendMode" = "搭配來源影像的光度使用背景的彩度和飽和度。此模式會製作一個與 CIColorBlendMode 濾鏡製作的效果相反的效果。";"CIMultiplyBlendMode" = "用背景影像樣板增強來源影像樣板。結果在顏色上，至少和其中兩個樣板顏色之一那樣暗。";"CIOverlayBlendMode" = "依照背景顏色，使用背景影像樣板來增強或掩蓋來源影像。結果將會覆疊現有影像樣板，而同時保留背景影像的高亮和陰影處。背景顏色會與來源影像混合，來反映出背景的明暗。";"CISaturationBlendMode" = "搭配來源影像的飽和度使用背景的彩度和光度。若背景區域沒有飽和度（也就是純灰色區域），則不會產生變化。";"CIScreenBlendMode" = "用背景影像樣板的反效果增強來源影像樣板的反效果。結果在顏色上，至少和其中兩個樣板顏色之一那樣亮。";"CISoftLightBlendMode" = "依照來源影像樣板顏色，提亮或變暗顏色。若來源影像樣板顏色亮過 50% 灰色，則會提亮背景，類似於減淡。若來源影像樣板顏色暗過 50% 灰色，則會令背景變暗，類似於加深。若來源影像樣板顏色剛好相當於 50% 灰色，則不會更動背景。而相當於純黑或白的影像樣板，會產生更暗或更亮的區域，但是不會導致結果是純黑或白。整體效果類似於您透過提亮照在來源影像的漫射聚光燈所達到的效果。";"outputImage" = "由濾鏡製作的影像。";"inputBackgroundImage" = "要用作背景影像的影像。";"inputImage" = "要用作輸入影像的影像。對於還使用背景影像的濾鏡，這是前景影像。";"inputTime" = "效果的持續時間。";"inputTransform" = "要套用的轉換。";"inputScale" = "效果的量。";"inputAspectRatio" = "顯示比例。";"inputCenter" = "區域的中心，如 x 和 y 座標，相對於濾鏡。";"inputRadius" = "效果中心的距離。";"inputAngle" = "角度。";"inputRefraction" = "效果中使用的物質（例如玻璃）的折射率索引。";"inputWidth" = "效果的寬度。";"inputSharpness" = "要套用的清晰度的量。";"inputIntensity" = "效果的強度。";"inputEV" = "要令影像的 F-停止更亮或更暗的數字。";"inputSaturation" = "調整飽和度的量。";"inputColor" = "顏色。";"inputBrightness" = "亮度水平。";"inputContrast" = "對比水平。";"inputGradientImage" = "含有 alpha 的環境對應。通常這是包含高亮和陰影的影像。";"inputMaskImage" = "被遮罩的影像。";"inputShadingImage" = "有 alpha 數值的環境對應。通常這是包含高亮和陰影的影像。";"inputTargetImage" = "過場效果的目標影像。";"inputExtent" = "定義效果範圍的矩形。";"CIBoxBlur.inputRadius" = "半徑決定要使用多少像素來製作模糊。半徑愈大，便愈模糊。";"CIDiscBlur.inputRadius" = "半徑決定要使用多少像素來製作模糊。半徑愈大，便愈模糊。";"CIGaussianBlur.inputRadius" = "半徑決定要使用多少像素來製作模糊。半徑愈大，便愈模糊。";"CIMotionBlur.inputRadius" ="半徑決定要使用多少像素來製作模糊。半徑愈大，便愈模糊。";"CIMotionBlur.inputAngle" = "動態效果的角度決定模糊鏡片的方向。";"CINoiseReduction.inputNoiseLevel" = "減少雜訊的量。數值愈大，減少雜訊愈多。";"CINoiseReduction.inputSharpness" = "最後影像的清晰度。數值愈大，結果愈輪廓鮮明。";"CIZoomBlur.inputCenter" = "x 和 y 位置是用作效果的中心。";"CIZoomBlur.inputAmount" = "縮小量。數字愈大，縮的愈小。";"CIColorControls.inputSaturation" = "要套用的飽和度。數值愈大，色彩便會愈豐滿。";"CIColorControls.inputBrightness" = "要套用的亮度量。數值愈大，便會愈明亮。";"CIColorControls.inputContrast" = "要套用的對比量。數值愈大，影像便會對比愈鮮明。";"CIColorMatrix.inputRVector" = "增加來源顏色數值的紅色的量。";"CIColorMatrix.inputGVector" = "增加來源顏色數值的綠色的量。";"CIColorMatrix.inputBVector" = "增加來源顏色數值的藍色的量。";"CIColorMatrix.inputAVector" = "增加來源顏色數值的 alpha 的量。";"CIColorMatrix.inputBiasVector" = "已增加到每個顏色組件的向量。";"CIExposureAdjust.inputEV" = "調整影像曝光的量。數值愈大，曝光便愈亮。";"CIGammaAdjust.inputPower" = "用來修正影像亮度的 gamma 數值。數值愈大，結果愈暗。";"CIHueAdjust.inputAngle" = "用來修正影像彩度的角度（以度為單位）。";"CIWhitePointAdjust.inputColor" = "要用作白色點的顏色。";"CIColorCube.inputDimension" = "色盤的尺寸。";"CIColorCube.inputCubeData" = "這是使用預增 alpha 的浮點 RGBA 格的色盤。格是以標準順序組合起來的。資料的欄和列分別是紅色和綠色。每個資料平面後會有個較高的資料平面，它是藍色的。";"CIColorMap.inputGradientImage" = "此影像的影像資料會變成來源影像數值。";"CIColorMonochrome.inputColor" = "要套用到影像的黑白顏色。";"CIColorMonochrome.inputIntensity" = "黑白效果的強度。數值 1.0 會使用提供的顏色製作黑白影像。而數值 0.0 則不會產生影像效果。";"CIColorPosterize.inputLevels" = "要用於每個顏色組件的亮度水平的數字。較低的數值會產生更大的海報效果。";"CIFalseColor.inputColor0" = "用於顏色選項的第一個顏色。";"CIFalseColor.inputColor1" = "用於顏色選項的第二個顏色。";"CISepiaTone.inputIntensity" = "烏賊墨色效果的強度。數值 1.0 會製作純烏賊墨色影像。而數值 0.0 則不會產生影像效果。";"CIBumpDistortion.inputCenter" = "x 和 y 位置是用作凹凸的中心。"; "CIBumpDistortion.inputRadius" = "半徑決定要使用多少像素來製作變形。半徑愈大，變形範圍愈廣。"; "CIBumpDistortion.inputScale" = "效果的縮放決定凹凸的彎曲率。數值為 0.0 表示沒有效果。正數值會製作向外凸出，而負數值會製作向內凹入。"; "CIBumpDistortionLinear.inputCenter" = "x 和 y 位置是用作變形的中心。"; "CIBumpDistortionLinear.inputRadius" = "半徑決定要使用多少像素來製作變形。半徑愈大，變形範圍愈廣。";  "CIBumpDistortionLinear.inputScale" = "效果的強弱。"; "CIBumpDistortionLinear.inputAngle" = "變形發生的周圍的線條角度（以度為單位）。"; "CICircleSplashDistortion.inputCenter" = "x 和 y 位置是用作變形的中心。";  "CICircleSplashDistortion.inputRadius" = "半徑決定要使用多少像素來製作變形。半徑愈大，變形範圍愈廣。";  "CICircularWrap.inputCenter" = "x 和 y 位置是用作變形的中心。";  "CICircularWrap.inputRadius" = "半徑決定要使用多少像素來製作變形。半徑愈大，變形範圍愈廣。";  "CICircularWrap.inputAngle" = "效果的角度。"; "CIDisplacementDistortion.inputDisplacementImage" = "會將影像的灰階數值套用到來源影像。"; "CIDisplacementDistortion.inputScale" = "結果影像的紋理量。數值愈大，影像紋理便會愈密集。"; "CIGlassDistortion.inputTexture" = "要套用到來源影像的質地。";"CIGlassDistortion.inputCenter" = "x 和 y 位置是用作變形的中心。"; "CIGlassDistortion.inputScale" = "結果影像的紋理量。數值愈大，影像紋理便會愈密集。"; "CIGlassLozenge.inputPoint0" = "定義菱形一端的圓的中心的 x 和 y 位置。"; "CIGlassLozenge.inputPoint1" = "定義菱形另一端的圓的中心的 x 和 y 位置。";  "CIGlassLozenge.inputRadius" = "菱形的半徑。數值愈大，變形範圍便會大。";  "CIGlassLozenge.inputRefraction" = "玻璃的折射。"; "CIHoleDistortion.inputCenter" = "x 和 y 位置是用作變形的中心。";  "CIHoleDistortion.inputRadius" = "半徑決定要使用多少像素來製作變形。半徑愈大，變形範圍愈廣。";  "CIPinchDistortion.inputCenter" = "x 和 y 位置是用作變形的中心。"; "CIPinchDistortion.inputRadius" = "半徑決定要使用多少像素來製作變形。半徑愈大，變形範圍愈廣。"; "CIPinchDistortion.inputScale" = "擠壓的量。數值為 0.0 表示沒有效果。數值為 1.0 表示最大的擠壓。";"CITorusLensDistortion.inputCenter" = "x 和 y 位置是用作圓形隆起的中心。";  "CITorusLensDistortion.inputRadius" = "圓形隆起的外部半徑。";  "CITorusLensDistortion.inputWidth" = "圓圈的寬度。"; "CITorusLensDistortion.inputRefraction" = "玻璃的折射。"; "CITwirlDistortion.inputCenter" = "x 和 y 位置是用作變形的中心。";  "CITwirlDistortion.inputRadius" = "半徑決定要使用多少像素來製作變形。半徑愈大，變形範圍愈廣。"; "CITwirlDistortion.inputAngle" = "旋轉的角度（以度為單位）。數值可以是整數或負數。";"CIVortexDistortion.inputCenter" = "x 和 y 位置是用作變形的中心。"; "CIVortexDistortion.inputRadius" = "半徑決定要使用多少像素來製作變形。半徑愈大，變形範圍愈廣。"; "CIVortexDistortion.inputAngle" = "旋渦的角度（以度為單位）。";"CICheckerboardGenerator.inputColor0" = "用於第一列棋盤方塊的顏色。";"CICheckerboardGenerator.inputColor1" = "用於第二列棋盤方塊的顏色。";"CICheckerboardGenerator.inputWidth" = "棋盤圖像中方塊的寬度。";"CICheckerboardGenerator.inputSharpness" = "棋盤圖像的清晰度。數值愈小，圖像愈模糊。數值範圍是 0.0 到 1.0。";"CIConstantColorGenerator.inputColor" = "要產生的顏色。"; "CILenticularHaloGenerator.inputCenter" = "x 和 y 位置是用作光暈的中心。";"CILenticularHaloGenerator.inputHaloRadius" = "光暈的半徑。";"CILenticularHaloGenerator.inputHaloWidth" = "光暈的寬度是從它的內在半徑到它的外在半徑。";"CILenticularHaloGenerator.inputOverlap" = "光暈的衍射組件重疊量。數值為 1.0 是完全重疊，而光暈是白色；數值為 1.0 是無重疊；光暈顏色不會重疊。";"CILenticularHaloGenerator.inputStriationStrength" = "光暈顏色的強度。數值愈大，強度愈高。";"CILenticularHaloGenerator.inputStriationContrast" = "光暈顏色的對比度。數值愈大，對比度愈高。";"CIStarShineGenerator.inputCenter" = "x 和 y 位置是用作星星的中心。"; "CIStarShineGenerator.inputColor" = "要用作圓形星星外殼的顏色。"; "CIStarShineGenerator.inputRadius" = "星星的半徑。"; "CIStarShineGenerator.inputCrossScale" = "跨越圖案的大小。"; "CIStarShineGenerator.inputCrossAngle" = "跨越圖案的角度。"; "CIStarShineGenerator.inputCrossOpacity" = "跨越圖案的透明度。"; "CIStarShineGenerator.inputCrossWidth" = "跨越圖案的寬度。"; "CIStarShineGenerator.inputEpsilon" = "跨越尖點的長度。"; "CIStripesGenerator.inputCenter" = "x 和 y 位置是用作條紋圖案的中心。"; "CIStripesGenerator.inputColor0" = "要用作單數條紋的顏色。"; "CIStripesGenerator.inputColor1" = "要用作偶數條紋的顏色。";"CIStripesGenerator.inputWidth" = "條紋的寬度。"; "CIStripesGenerator.inputSharpness" = "條紋圖像的清晰度。數值愈小，圖像愈模糊。數值範圍是 0.0 到 1.0。"; "CISunbeamsGenerator.inputCenter" = "x 和 y 位置是用作日射圖案的中心。";"CISunbeamsGenerator.inputColor" = "太陽的顏色。";"CISunbeamsGenerator.inputSunRadius" = "太陽的半徑。";"CISunbeamsGenerator.inputMaxStriationRadius" = "日射的半徑。";"CISunbeamsGenerator.inputStriationStrength" = "日射的強度。數值愈大，強度愈高。";"CISunbeamsGenerator.inputStriationContrast" = "日射的對比度。數值愈大，對比度愈高。";"CIAffineTransform.inputTransform" = "要套用到影像上的轉變。"; "CICrop.inputRectangle" = "要套用到影像且指定裁切範圍的矩形。"; "CILanczosScaleTransform.inputScale" = "要用於影像的縮放因素。小於 1.0 的數值會縮小影像，大於 1.0 的則放大影像。"; "CILanczosScaleTransform.inputAspectRatio" = "影像的顯示比例。"; "CIPerspectiveTransform.inputTopLeft" = "上方左邊是影像對齊的座標。"; "CIPerspectiveTransform.inputTopRight" = "上方右邊是影像對齊的座標。"; "CIPerspectiveTransform.inputBottomRight" = "底部右邊是影像對齊的座標。"; "CIPerspectiveTransform.inputBottomLeft" = "底部左邊是影像對齊的座標。"; "CIGaussianGradient.inputColor0" = "用於傾斜度的第一個顏色。"; "CIGaussianGradient.inputColor1" = "用於傾斜度的第二個顏色。"; "CIGaussianGradient.inputRadius" = "高斯（Gaussian）分佈的半徑。"; "CILinearGradient.inputPoint0" = "傾斜的開始位置，也是第一個顏色的開始的地方。"; "CILinearGradient.inputPoint1" = "傾斜的結束位置，也是第一個顏色的結束的地方。"; "CILinearGradient.inputColor0" = "用於傾斜度的第一個顏色。";  "CILinearGradient.inputColor1" = "用於傾斜度的第二個顏色。";  "CIRadialGradient.inputRadius0" = "要在傾斜中使用的開始圓圈的半徑。";"CIRadialGradient.inputRadius1" = "要在傾斜中使用的結束圓圈的半徑。";"CIRadialGradient.inputColor0" = "用於傾斜度的第一個顏色。";  "CIRadialGradient.inputColor1" = "用於傾斜度的第二個顏色。"; "CICircularScreen.inputCenter" = "x 和 y 位置是用作圓形螢幕圖案的中心。"; "CICircularScreen.inputWidth" = "圖案中每個圓形的距離。"; "CICircularScreen.inputSharpness" = "圓形的清晰度。數值愈大，圓形輪廓愈鮮明。"; "CICMYKHalftone.inputCenter" = "x 和 y 位置是用作半色調圖案的中心。";  "CICMYKHalftone.inputWidth" = "圖案中點的距離。"; "CICMYKHalftone.inputAngle" = "圖案的角度。"; "CICMYKHalftone.inputSharpness" = "圖案的清晰度。數值愈大，圖案愈輪廓鮮明。"; "CICMYKHalftone.inputGCR" = "取代灰色組件數值。數值範圍是 0.0（無）到 1.0。"; "CICMYKHalftone.inputUCR" = "背景顏色變化數值。數值範圍是 0.0 到 1.0。"; "CIDotScreen.inputCenter" = "x 和 y 位置是用作點螢幕圖案的中心。";  "CIDotScreen.inputAngle" = "圖案的角度。"; "CIDotScreen.inputWidth" = "圖案中點的距離。"; "CIDotScreen.inputSharpness" = "圖案的清晰度。數值愈大，圖案愈輪廓鮮明。"; "CIHatchedScreen.inputCenter" = "x 和 y 位置是用作劃影線的螢幕圖案的中心"; "CIHatchedScreen.inputAngle" = "圖案的角度。";"CIHatchedScreen.inputWidth" = "圖案中線的距離。"; "CIHatchedScreen.inputShaprness" = "圖案的清晰度。數值愈大，圖案愈輪廓鮮明。"; "CILineScreen.inputCenter" = "x 和 y 位置是用作線條的螢幕圖案的中心";  "CILineScreen.inputAngle" = "圖案的角度。"; "CILineScreen.inputWidth" = "圖案中線的距離。"; "CILineScreen.inputSharpness" = "圖案的清晰度。數值愈大，圖案愈輪廓鮮明。"; 	"CISharpenLuminance.inputSharpness" = "要套用的清晰度的量。數字愈大愈清晰。";"CIUnsharpMask.inputRadius" = "圍繞所給像素的半徑以套用反銳化遮罩。半徑愈大，影響影像的範圍也會愈大。";"CIUnsharpMask.inputIntensity" = "效果的強度。數值愈大，影響區域的對比愈強。";"CIBlendWithMask.inputMaskImage" = "灰階遮罩。當遮罩的數值是 0.0，結果為背景。當數值是 1.0，結果為影像。"; "CIBloom.inputRadius" = "半徑決定要使用多少像素來製作效果。半徑愈大，效果愈強。";"CIBloom.inputIntensity" = "效果的強度。數值為 0.0 表示沒有效果。數值為 1.0 表示最大效果。"; "CICrystallize.inputRadius" = "半徑決定要使用多少像素來製作效果。半徑愈大，結果愈透明。"; "CIEdges.inputIntensity" = "邊緣的強度。數值愈大，強度愈高。"; "CIEdgeWork.inputRadius" = "邊緣的深淺。數值愈大，邊緣愈深。"; "CIGloom.inputRadius" = "半徑決定要使用多少像素來製作效果。半徑愈大，效果愈強。"; "CIGloom.inputIntensity" = "效果的強度。數值為 0.0 表示沒有效果。數值為 1.0 表示最大效果。"; "CIHeightFieldFromMask.inputImage" = "遮罩的白色數值會定義高度欄位內的像素，而黑色數值則會定義高度欄位外的像素。欄位會在遮罩內平滑連續地變化，直到達到遮罩邊緣的數值 0。"; "CIHeightFieldFromMask.inputRadius" = "為了平滑過場效果的遮罩邊緣的距離是與輸入半徑成比例。較大數值會令過場效果更平滑明顯。較小數值會令過場效果近似一束半徑。"; "CIHexagonalPixellate.inputCenter" = "x 和 y 位置是用作效果的中心"; "CIHexagonalPixellate.inputScale" = "縮放決定六角形的大小。數值愈大，六角形愈大。"; "CILineOverlay.inputNRNoiseLevel" = "在追蹤影像邊緣前被移除的影像（搭配攝影機資料使用）雜訊位準。增加雜訊位準有助於清除影像的追蹤邊緣。"; "CILineOverlay.inputNRSharpness" = "在追蹤影像邊緣前、當移除雜訊時的清晰度的量。這會提高取得邊緣。"; "CILineOverlay.inputEdgeIntensity" = "當追蹤影像邊緣時，索貝爾（Sobel）梯度資訊 的輪廓的明顯性。數值愈高，會找到愈多邊緣，然而通常使用的是低數值（例如 1.0）。"; "CILineOverlay.inputThreshold" = "此數值決定邊緣的可見度。數值愈大，邊緣愈薄。"; "CILineOverlay.inputContrast" = "此濾鏡製作的用於邊緣的柔邊量。數值愈高，製作的邊緣對比愈高（也就是愈少柔邊）。"; "CIPixellate.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIPixellate.inputScale" = "縮放決定方形的大小。數值愈大，方形愈大。"; "CIPointillize.inputRadius" = "結果圖案中圓形的半徑。"; "CIPointillize.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIShadedMaterial.inputShadingImage" = "要用作影像的高度範圍。結果影像中，形狀顏色較亮會變得更高，而形狀顏色較暗的則變得較矮（較低區域）。"; "CIShadedMaterial.inputScale" = "效果的縮放。數值愈高，效果愈引人注目。"; "CISpotColor.inputCenterColor1" = "要取代的第一種顏色的中心數值。"; "CISpotColor.inputReplacementColor1" = "在第一顏色範圍的顏色取代。"; "CISpotColor.inputCloseness1" = "在發生取代前，表明第一種顏色要如何結束的數值必須適合。"; "CISpotColor.inputContrast1" = "第一取代顏色的對比度。"; "CISpotColor.inputCenterColor2" = "要取代的第二種顏色的中心數值。"; "CISpotColor.inputReplacementColor2" = "在第二顏色範圍的顏色取代。";"CISpotColor.inputCloseness2" = "在發生取代前，表明第二種顏色要如何結束的數值必須適合。"; "CISpotColor.inputContrast2" = "第二取代顏色的對比度。"; "CISpotColor.inputCenterColor3" = "要取代的第三種顏色的中心數值。";  "CISpotColor.inputReplacementColor3" = "在第三顏色範圍的顏色取代。"; "CISpotColor.inputCloseness3" = "在發生取代前，表明第三種顏色要如何結束的數值必須適合。";  "CISpotColor.inputContrast3" = "第三取代顏色的對比度。";  "CISpotLight.inputLightPosition" = "聚光燈的 x 和 y 位置。"; 		"CISpotLight.inputLightPointsAt" = "聚光燈的小點的 x 和 y 位置。";  "CISpotLight.inputBrightness" = "聚光燈的亮度。"; "CISpotLight.inputConcentration" = "聚光燈大小。數值愈小，燈光束會聚合得愈緊密。"; "CISpotLight.inputColor" = "聚光燈的顏色。"; "CIAffineClamp.inputTransform" = "要套用到影像的轉變。"; "CIAffineTile.inputTransform" = "要套用到影像的轉變。"; "CIEightfoldReflectedTile.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIEightfoldReflectedTile.inputAngle" = "並排化圖案的角度（以度為單位）。"; "CIEightfoldReflectedTile.inputWidth" = "並排的寬度。"; "CIFourfoldReflectedTile.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIFourfoldReflectedTile.inputAngle" = "並排化圖案的角度（以度為單位）。";  "CIFourfoldReflectedTile.inputAcuteAngle" = "重複反射並排的主要角度。小的數值會製作薄薄的菱形並排，大的數值會製作較厚的反射並排。"; "CIFourfoldReflectedTile.inputWidth" = "並排的寬度。";  "CIFourfoldRotatedTile.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIFourfoldRotatedTile.inputAngle" = "並排化圖案的角度（以度為單位）。";  "CIFourfoldRotatedTile.inputWidth" = "並排的寬度。"; "CIFourfoldTranslatedTile.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIFourfoldTranslatedTile.inputAngle" = "並排化圖案的角度（以度為單位）。";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "重複轉化的並排的主要角度。小的數值會製作薄薄的菱形並排，大的數值會製作較厚的轉化的並排。"; "CIFourfoldTranslatedTile.inputWidth" = "並排的寬度。";  "CIGlideReflectedTile.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIGlideReflectedTile.inputAngle" = "並排化圖案的角度（以度為單位）。";  "CIGlideReflectedTile.inputWidth" = "並排的寬度。";  "CIKaleidoscope.inputCount" = "圖案中反射的數量。"; "CIKaleidoscope.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIKaleidoscope.inputAngle" = "反射的角度。"; "CIOpTile.inputCenter" = "x 和 y 位置是用作效果的中心";  "CIOpTile.inputScale" = "縮放決定效果中並排的數量。"; "CIOpTile.inputAngle" = "並排的角度。"; "CIOpTile.inputWidth" = "並排的寬度。"; "CIParallelogramTile.inputCenter" = "x 和 y 位置是用作效果的中心"; "CIParallelogramTile.inputAngle" = "並排化圖案的角度（以度為單位）。";  "CIParallelogramTile.inputAcuteAngle" = "重複平行四邊形的並排的主要角度。小的數值會製作薄薄的菱形並排，大的數值會製作較厚的平行四邊形的並排。"; "CIParallelogramTile.inputWidth" = "並排的寬度。";  "CIPerspectiveTile.inputTopLeft" = "上方左邊作為並排的座標。"; "CIPerspectiveTile.inputTopRight" = "上方右邊作為並排的座標。";"CIPerspectiveTile.inputBottomRight" = "底部右邊作為並排的座標。"; "CIPerspectiveTile.inputBottomLeft" = "底部左邊作為並排的座標。"; "CISixfoldReflectedTile.inputCenter" = "x 和 y 位置是用作效果的中心";  "CISixfoldReflectedTile.inputAngle" = "並排化圖案的角度（以度為單位）。";  "CISixfoldReflectedTile.inputWidth" = "並排的寬度。"; "CISixfoldRotatedTile.inputCenter" = "x 和 y 位置是用作效果的中心"; "CISixfoldRotatedTile.inputAngle" = "並排化圖案的角度（以度為單位）。";  "CISixfoldRotatedTile.inputWidth" = "並排的寬度。";  "CITriangleTile.inputCenter" = "x 和 y 位置是用作效果的中心";  "CITriangleTile.inputAngle" = "並排化圖案的角度（以度為單位）。";  "CITriangleTile.inputWidth" = "並排的寬度。";  "CITwelvefoldReflectedTile.inputCenter" = "x 和 y 位置是用作效果的中心"; "CITwelvefoldReflectedTile.inputAngle" = "並排化圖案的角度（以度為單位）。";"CITwelvefoldReflectedTile.inputWidth" = "並排的寬度。"; "CIBarsSwipeTransition.inputAngle" = "列的角度（以度為單位）。";	"CIBarsSwipeTransition.inputWidth" = "每個列的寬度。";	"CIBarsSwipeTransition.inputBarOffset" = "一個列的位移（相對於另外一個列）";	"CIBarsSwipeTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CICopyMachineTransition.inputColor" = "淺色拷貝的顏色。";"CICopyMachineTransition.inputAngle" = "淺色拷貝的角度。";"CICopyMachineTransition.inputWidth" = "淺色拷貝的寬度。";"CICopyMachineTransition.inputOpacity" = "淺色拷貝的透明度。數值為 0.0 表示透明。數值為 1.0 表示不透明。";"CICopyMachineTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CIDisintegrateWithMaskTransition.inputMaskImage" = "當碎裂來源為目標影像時要使用的定義形狀的影像。";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "由遮罩製作的陰影的半徑。";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "由遮罩製作的陰影的密度。";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "由遮罩製作的陰影的位移。";"CIDisintegrateWithMaskTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CIDissolveTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CIFlashTransition.inputCenter" = "x 和 y 位置是用作效果的中心"; "CIFlashTransition.inputExtent" = "閃光的範圍。";"CIFlashTransition.inputColor" = "從閃光中散發出來的淡光的顏色。";"CIFlashTransition.inputMaxStriationRadius" = "從閃光中散發出來的淡光的半徑。";"CIFlashTransition.inputStriationStrength" = "從閃光中散發出來的淡光的濃度。";"CIFlashTransition.inputStriationContrast" = "從閃光中散發出來的淡光的對比。";"CIFlashTransition.inputFadeThreshold" = "閃光和目標影像之間的淡入淡出量。數值愈大，閃光時間愈長，而淡出時間也愈少。";"CIFlashTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CIModTransition.inputCenter" = "x 和 y 位置是用作效果的中心"; "CIModTransition.inputAngle" = "mod hole 的角度。";"CIModTransition.inputRadius" = "圖案中沒有變形的支持物的半徑。";"CIModTransition.inputCompression" = "已套用到 mod hole 圖案的延伸量。中心的支持物變形程度比影像邊緣的變形程度小。";"CIModTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CIPageCurlTransition.inputBacksideImage" = "來源影像的背面會出現有影像，因為頁面捲曲而顯示出目標影像。";"CIPageCurlTransition.inputShadingImage" = "一個影像，看起來是一個被限制在方框影像的較暗的球體。";"CIPageCurlTransition.inputExtent" = "效果的範圍。";"CIPageCurlTransition.inputAngle" = "捲曲頁面的角度。";"CIPageCurlTransition.inputRadius" = "捲曲的半徑。";"CIPageCurlTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CIRippleTransition.inputShadingImage" = "一個影像，看起來是一個被限制在方框影像的較暗的球體。";"CIRippleTransition.inputCenter" = "x 和 y 位置是用作效果的中心"; "CIRippleTransition.inputExent" = "效果的範圍。";"CIRippleTransition.inputWidth" = "漣漪的寬度。";"CIRippleTransition.inputScale" = "數值，它決定是要凸起（較大數值）還是凹下（較小數值）來作為漣漪的開始。";"CIRippleTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CISwipeTransition.inputExtent" = "效果的範圍。";"CISwipeTransition.inputColor" = "擦過動作的顏色。";"CISwipeTransition.inputAngle" = "擦過動作的角度。";"CISwipeTransition.inputWidth" = "擦過動作的寬度";"CISwipeTransition.inputOpacity" = "擦過動作的透明度。";"CISwipeTransition.inputTime" = "過場效果的參數時間。此數值驅使過場效果從開始（時間 0）到結束（時間 1）。";"CIAreaHistogram" = "計算影像指定區域內的直方圖，並以 1D 影像傳回結果。";"CIAreaHistogram.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIAreaHistogram.inputCount" = "直方圖的 bin 數目。";"CIAreaHistogram.inputImage" = "您想要計算其直方圖的影像。";"CIAreaHistogram.inputScale" = "用於直方圖數值的縮放數值。";"CIAreaMaximum" = "計算影像指定區域內的最大組件數值，並以像素傳回結果。";"CIAreaMaximum.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIAreaMaximum.inputImage" = "要處理的影像。";"CIAreaMinimum" = "計算影像指定區域內的最小組件數值，並以像素傳回結果。";"CIAreaMinimum.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIAreaMinimum.inputImage" = "要處理的影像。";"CIAreaMaximumAlpha" = "尋找並傳回帶有最大 alpha 值的像素。";"CIAreaMaximumAlpha.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIAreaMaximumAlpha.inputImage" = "要處理的影像。";"CIAreaMinimumAlpha" = "尋找並傳回帶有最小 alpha 值的像素。";"CIAreaMinimumAlpha.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIAreaMinimumAlpha.inputImage" = "要處理的影像。";"CIAreaAverage" = "計算影像指定區域內的平均顏色數目，並以像素傳回結果。";"CIAreaAverage.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIAreaAverage.inputImage" = "要處理的影像。";"CIRowAverage" = "計算影像指定區域內每個橫列的平均顏色數目，並以 1D 影像傳回結果。";"CIRowAverage.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIRowAverage.inputImage" = "要處理的影像。";"CIColumnAverage" = "計算影像指定區域內每個直欄的平均顏色數目，並以 1D 影像傳回結果。";"CIColumnAverage.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIColumnAverage.inputImage" = "要處理的影像。";"CIMinimumComponent" = "使用三個顏色組件的最小值來將影像轉換成灰階。";"CIMinimumComponent.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIMinimumComponent.inputImage" = "要處理的影像。";"CIMaximumComponent" = "使用三個顏色組件的最大值來將影像轉換成灰階。";"CIMaximumComponent.inputExtent" = "指定您要處理之影像子區域的矩形。";"CIMaximumComponent.inputImage" = "要處理的影像。";